# Introduction To Pandas

In [1]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\adhik\anaconda3\lib\site-packages (1.21.5)

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\adhik\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\adhik\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\adhik\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\adhik\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\adhik\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd   # pandas perform data manipulation, slicing and dicing data
import numpy as np    #NumPy provide efficient data operations on arrays, matrices and algebra

In [4]:
df = pd.read_csv("Salaries.csv")   # Pandas allows importing data from various file formats
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

# Functions are customizable, hence there is a parenthesis, where we can pass argument to modify the output accordingly.

In [5]:
df.head()  # shows first 5 records by default

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [6]:
df.head(10)   # shows first n records, where n is no. passed to function df.head()

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [7]:
df.tail()   # shows last 5 records by default

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [8]:
df.tail(10)  # shows last n records, where n is no. passed to function df.tail()

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

# Attributes are not customizable, hence there is no parenthesis where we can pass arguments.

In [9]:
df.dtypes # shows data type of all variable in df; here, object means string

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [10]:
df["salary"].dtype  #data type of specified variable; [ ] is used to refer a column from df

dtype('int64')

In [11]:
df.shape   # shows shape i.e (no. of rows, no. of columns) of given df

(78, 6)

In [12]:
df.size    # shows total no. of elements in df

468

In [13]:
df.ndim   #gives no. of dimensions

2

In [14]:
#data frame is made up of row index,column index and values

df.index  # gives row indexes

RangeIndex(start=0, stop=78, step=1)

In [15]:
df.columns #gives column indexes

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [16]:
df.axes  #gives row indexes and column indexes combined

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [17]:
df.values  #gives values of data frame

array([['Prof', 'B', 56, 49, 'Male', 186960],
       ['Prof', 'A', 12, 6, 'Male', 93000],
       ['Prof', 'A', 23, 20, 'Male', 110515],
       ['Prof', 'A', 40, 31, 'Male', 131205],
       ['Prof', 'B', 20, 18, 'Male', 104800],
       ['Prof', 'A', 20, 20, 'Male', 122400],
       ['AssocProf', 'A', 20, 17, 'Male', 81285],
       ['Prof', 'A', 18, 18, 'Male', 126300],
       ['Prof', 'A', 29, 19, 'Male', 94350],
       ['Prof', 'A', 51, 51, 'Male', 57800],
       ['Prof', 'B', 39, 33, 'Male', 128250],
       ['Prof', 'B', 23, 23, 'Male', 134778],
       ['AsstProf', 'B', 1, 0, 'Male', 88000],
       ['Prof', 'B', 35, 33, 'Male', 162200],
       ['Prof', 'B', 25, 19, 'Male', 153750],
       ['Prof', 'B', 17, 3, 'Male', 150480],
       ['AsstProf', 'B', 8, 3, 'Male', 75044],
       ['AsstProf', 'B', 4, 0, 'Male', 92000],
       ['Prof', 'A', 19, 7, 'Male', 107300],
       ['Prof', 'A', 29, 27, 'Male', 150500],
       ['AsstProf', 'B', 4, 4, 'Male', 92000],
       ['Prof', 'A', 33, 30, 'Male', 103106],
       ['AsstProf', 'A', 4, 2, 'Male', 73000],
       ['AsstProf', 'A', 2, 0, 'Male', 85000],
       ['Prof', 'A', 30, 23, 'Male', 91100],
       ['Prof', 'B', 35, 31, 'Male', 99418],
       ['Prof', 'A', 38, 19, 'Male', 148750],
       ['Prof', 'A', 45, 43, 'Male', 155865],
       ['AsstProf', 'B', 7, 2, 'Male', 91300],
       ['Prof', 'B', 21, 20, 'Male', 123683],
       ['AssocProf', 'B', 9, 7, 'Male', 107008],
       ['Prof', 'B', 22, 21, 'Male', 155750],
       ['Prof', 'A', 27, 19, 'Male', 103275],
       ['Prof', 'B', 18, 18, 'Male', 120000],
       ['AssocProf', 'B', 12, 8, 'Male', 119800],
       ['Prof', 'B', 28, 23, 'Male', 126933],
       ['Prof', 'B', 45, 45, 'Male', 146856],
       ['Prof', 'A', 20, 8, 'Male', 102000],
       ['AsstProf', 'B', 4, 3, 'Male', 91000],
       ['Prof', 'B', 18, 18, 'Female', 129000],
       ['Prof', 'A', 39, 36, 'Female', 137000],
       ['AssocProf', 'A', 13, 8, 'Female', 74830],
       ['AsstProf', 'B', 4, 2, 'Female', 80225],
       ['AsstProf', 'B', 5, 0, 'Female', 77000],
       ['Prof', 'B', 23, 19, 'Female', 151768],
       ['Prof', 'B', 25, 25, 'Female', 140096],
       ['AsstProf', 'B', 11, 3, 'Female', 74692],
       ['AssocProf', 'B', 11, 11, 'Female', 103613],
       ['Prof', 'B', 17, 17, 'Female', 111512],
       ['Prof', 'B', 17, 18, 'Female', 122960],
       ['AsstProf', 'B', 10, 5, 'Female', 97032],
       ['Prof', 'B', 20, 14, 'Female', 127512],
       ['Prof', 'A', 12, 0, 'Female', 105000],
       ['AsstProf', 'A', 5, 3, 'Female', 73500],
       ['AssocProf', 'A', 25, 22, 'Female', 62884],
       ['AsstProf', 'A', 2, 0, 'Female', 72500],
       ['AssocProf', 'A', 10, 8, 'Female', 77500],
       ['AsstProf', 'A', 3, 1, 'Female', 72500],
       ['Prof', 'B', 36, 26, 'Female', 144651],
       ['AssocProf', 'B', 12, 10, 'Female', 103994],
       ['AsstProf', 'B', 3, 3, 'Female', 92000],
       ['AssocProf', 'B', 13, 10, 'Female', 103750],
       ['AssocProf', 'B', 14, 7, 'Female', 109650],
       ['Prof', 'A', 29, 27, 'Female', 91000],
       ['AssocProf', 'A', 26, 24, 'Female', 73300],
       ['Prof', 'A', 36, 19, 'Female', 117555],
       ['AsstProf', 'A', 7, 6, 'Female', 63100],
       ['Prof', 'A', 17, 11, 'Female', 90450],
       ['AsstProf', 'A', 4, 2, 'Female', 77500],
       ['Prof', 'A', 28, 7, 'Female', 116450],
       ['AsstProf', 'A', 8, 3, 'Female', 78500],
       ['AssocProf', 'B', 12, 9, 'Female', 71065],
       ['Prof', 'B', 24, 15, 'Female', 161101],
       ['Prof', 'B', 18, 10, 'Female', 105450],
       ['AssocProf', 'B', 19, 6, 'Female', 104542],
       ['Prof', 'B', 17, 17, 'Female', 124312],
       ['Prof', 'A', 28, 14, 'Female', 109954],
       ['Prof', 'A', 23, 15, 'Female', 109646]], dtype=object)

In [18]:
df.describe()  #summary of data frame

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [19]:
df.info()     #gives names of columns, no. of non null entries, and data type of each column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [20]:
# df.info , df.describe if typed without () then both willl print df as it is

In [21]:
df.min()  # min for categorical variable -> gives alphabetically 1st element

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [22]:
df.max()   # max for categorical variable -> gives alphabetically last element

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [23]:
df["phd"].count()  #count() gives no. of entries in specified column

78

In [24]:
df["sex"].value_counts()  #value_counts() is for categorical variable,

Male      39
Female    39
Name: sex, dtype: int64

In [25]:
df[["rank","sex"]].value_counts()

rank       sex
Prof       Male      28
           Female    18
AsstProf   Female    11
AssocProf  Female    10
AsstProf   Male       8
AssocProf  Male       3
dtype: int64

In [52]:
import warnings
warnings.filterwarnings("ignore")

In [53]:
df.mean()  # gives mean for numerical variable

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [27]:
df["phd"].mean()  # mean of specified variable "phd"

19.705128205128204

In [54]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [55]:
df.var()  # variance

phd        1.562106e+02
service    1.473740e+02
salary     8.005313e+08
dtype: float64

In [56]:
df.std()    # standard deviation

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [57]:
df.skew()
#skewness +ve -> right skewed data -> mean>median
#skewness -ve -> left skewed data -> mean<median
#skewness zero -> perfectly symmetrical data -> mean = median

phd        0.634366
service    0.913750
salary     0.452103
dtype: float64

In [58]:
df.kurt()
#kurtosis > 3 -> sharp peak -> thin tail (very less observations at ends)
#kurtosis < 3 -> flat distribution -> fat tails (most of observations at ends)
#kurtosis = 3 -> normal distribution

phd        0.042504
service    0.608981
salary    -0.401713
dtype: float64

In [33]:
df.sample(10)  # 10 random samples from df

         rank discipline  phd  service     sex  salary
22   AsstProf          A    4        2    Male   73000
6   AssocProf          A   20       17    Male   81285
13       Prof          B   35       33    Male  162200
55   AsstProf          A    2        0  Female   72500
1        Prof          A   12        6    Male   93000
63       Prof          A   29       27  Female   91000
3        Prof          A   40       31    Male  131205
41  AssocProf          A   13        8  Female   74830
19       Prof          A   29       27    Male  150500
64  AssocProf          A   26       24  Female   73300

In [34]:
df.sample(frac=0.1)  # no. of samples given is 10% of no. of entries in df

         rank discipline  phd  service     sex  salary
69       Prof          A   28        7  Female  116450
56  AssocProf          A   10        8  Female   77500
53   AsstProf          A    5        3  Female   73500
62  AssocProf          B   14        7  Female  109650
67       Prof          A   17       11  Female   90450
12   AsstProf          B    1        0    Male   88000
29       Prof          B   21       20    Male  123683
44       Prof          B   23       19  Female  151768

In [35]:
df.dropna()  #drop missing values

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [36]:
df.salary.head().mean()

125296.0

In [37]:
df["salary"].head().mean()  # prefered way over above code
# gives mean of first 5 salary entries.

125296.0

In [38]:
df[["salary","service"]].head().mean()  #for 2 columns
# first [] refers to column, second [] indicates list of columns
# list ["salary","service"] is given as input since it takes only one ip

salary     125296.0
service        24.8
dtype: float64

In [39]:
#groupby is used for categorical variables
df.groupby("sex").mean()
#groups sex into male and female and then gives mean of all numerical columns for male and female separately

              phd    service         salary
sex
Female  16.512821  11.564103  101002.410256
Male    22.897436  18.538462  115045.153846

In [40]:
df.groupby("sex")[["salary"]].mean()
#groups sex into male and female and then gives mean of their salary

               salary
sex
Female  101002.410256
Male    115045.153846

# Slicing by value -> Conditions -> Slices just rows, not columns

In [41]:
# for numerical variable, there are 6 ways of conditions, i.e ==, !=, >=, <= ,>, < 
# for categorical variable, there are 2 ways of condotions, i.e ==, !=

In [42]:
df["salary"]>=150000  #give serial no.s having salary >= 1.5l

0      True
1     False
2     False
3     False
4     False
      ...
73    False
74    False
75    False
76    False
77    False
Name: salary, Length: 78, dtype: bool

In [43]:
df[df["salary"]>=150000]   ##give entries having salary >= 1.5l

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [44]:
df[df["discipline"]=="B"]

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
4        Prof          B   20       18    Male  104800
10       Prof          B   39       33    Male  128250
11       Prof          B   23       23    Male  134778
12   AsstProf          B    1        0    Male   88000
13       Prof          B   35       33    Male  162200
14       Prof          B   25       19    Male  153750
15       Prof          B   17        3    Male  150480
16   AsstProf          B    8        3    Male   75044
17   AsstProf          B    4        0    Male   92000
20   AsstProf          B    4        4    Male   92000
25       Prof          B   35       31    Male   99418
28   AsstProf          B    7        2    Male   91300
29       Prof          B   21       20    Male  123683
30  AssocProf          B    9        7    Male  107008
31       Prof          B   22       21    Male  155750
33       Prof          B   18       18    Male  120000
34  AssocProf          B   12        8    Male  119800
35       Prof          B   28       23    Male  126933
36       Prof          B   45       45    Male  146856
38   AsstProf          B    4        3    Male   91000
39       Prof          B   18       18  Female  129000
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000
44       Prof          B   23       19  Female  151768
45       Prof          B   25       25  Female  140096
46   AsstProf          B   11        3  Female   74692
47  AssocProf          B   11       11  Female  103613
48       Prof          B   17       17  Female  111512
49       Prof          B   17       18  Female  122960
50   AsstProf          B   10        5  Female   97032
51       Prof          B   20       14  Female  127512
58       Prof          B   36       26  Female  144651
59  AssocProf          B   12       10  Female  103994
60   AsstProf          B    3        3  Female   92000
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312

In [45]:
#passed by reference(prefered way)
con1=df["sex"]=="Male"
con2=df["salary"]>=160000

df[con1 & con2]

    rank discipline  phd  service   sex  salary
0   Prof          B   56       49  Male  186960
13  Prof          B   35       33  Male  162200

In [46]:
#passed by value
df[(df["salary"]>150000) & (df["rank"]=="Prof")]

    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
19  Prof          A   29       27    Male  150500
27  Prof          A   45       43    Male  155865
31  Prof          B   22       21    Male  155750
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

# Slicing by index nos. -> loc, iloc -> Slices both rows and columns

In [47]:
#iloc -> give index no. of column 
#loc -> give name of column

In [48]:
df.iloc[:,0:3]   # [rows,columns] ->gives all rows and column 0 to 2

         rank discipline  phd
0        Prof          B   56
1        Prof          A   12
2        Prof          A   23
3        Prof          A   40
4        Prof          B   20
..        ...        ...  ...
73       Prof          B   18
74  AssocProf          B   19
75       Prof          B   17
76       Prof          A   28
77       Prof          A   23

[78 rows x 3 columns]

In [49]:
df.loc[0:10, "rank":"phd"]   # gives row entries from 0 to 9 for column rank to phd

         rank discipline  phd
0        Prof          B   56
1        Prof          A   12
2        Prof          A   23
3        Prof          A   40
4        Prof          B   20
5        Prof          A   20
6   AssocProf          A   20
7        Prof          A   18
8        Prof          A   29
9        Prof          A   51
10       Prof          B   39

In [50]:
#if you want columns which are not in sequence
df.loc[0:10, ["rank", "phd","salary"]]

         rank  phd  salary
0        Prof   56  186960
1        Prof   12   93000
2        Prof   23  110515
3        Prof   40  131205
4        Prof   20  104800
5        Prof   20  122400
6   AssocProf   20   81285
7        Prof   18  126300
8        Prof   29   94350
9        Prof   51   57800
10       Prof   39  128250

# Slicing by both value(condition) & index

In [51]:
df[df["salary"]>150000][["rank","discipline"]]

    rank discipline
0   Prof          B
13  Prof          B
14  Prof          B
15  Prof          B
19  Prof          A
27  Prof          A
31  Prof          B
44  Prof          B
72  Prof          B

# Data Frame & Duplicates

In [1]:
df1=pd.DataFrame({"col1":["A","A","B",'B'],"col2":[1,2,3,3]})

NameError: name 'pd' is not defined

In [2]:
#DataFrame is native of pandas hence first import pandas library
#Data Frames are data displayed in a format as a table. Data Frames can have different types of data inside it

import pandas as pd
df1=pd.DataFrame({"col1":["A","A","B",'B'],"col2":[1,2,3,3]})
df1

  col1  col2
0    A     1
1    A     2
2    B     3
3    B     3

In [3]:
df1.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [4]:
df1.drop_duplicates()

  col1  col2
0    A     1
1    A     2
2    B     3